<template>
<div v-cloak>
    <mt-header title="系统配置平台" fixed v-if="$root.transitionComplete"></mt-header>
    <div class="section">
        <div class="sectionMargin">
            <div class="mtArticle">
                <h1 class="mtArticleH1">
                    <span>系统配置平台（CES Syscfg）</span>
                </h1>
                <p>为了更好的利用项目开发积累的知识和经验，整合各行业及部门的可复用资源，建立构件化、标准化的基础功能模块，我司设计开发了系统配置平台，将整理优化后的功能模块以插件形式统一打包，形成一个个的行业系统开发可复用构件，最终汇聚成公司级的构件仓库。系统配置平台的应用，使架构在其上的应用系统具有良好的柔性，大大延长了系统的寿命，增强了系统的自适应性和可扩展性。</p>
                <p>系统配置平台的研发改变了传统应用软件的开发模式，即从调研<span class="font-wingdings">à</span>分析<span class="font-wingdings">à</span>设计<span class="font-wingdings">à</span>开发<span class="font-wingdings">à</span>测试<span class="font-wingdings">à</span>实施整个生命周期都强烈依赖于软件技术人员的个人能力的现状，使工厂化的软件开发成为可能。这其中，系统配置平台就是软件工厂中的加工流水线，处于其中最核心的位置，如下图所示：</p>
                <div class="articleImg clearfix">
                    <img src="../images/config1.png" class="oneImg">
                </div>
                <p>系统配置平台提供系统管理员和业务管理员对业务分类、数据结构、应用功能、个性化界面等多方面的自定义和各类参数的配置功能，并且将自定义和配置的结果固化成业务构件归入构件仓库，并通过构件的装配形成能够实现一定需求的功能模块，从而满足用户单位对应用系统功能扩展和调整的需要。系统配置平台主要功能框架如下图所示：</p>
                <div class="articleImg clearfix">
                    <img src="../images/config2.png" class="oneImg">
                </div>
                <p>该平台提供了丰富的系统配置功能，既包括各种基础定义功能，又包括业务定义功能（根据不同行业开发不同的业务构件，比如监狱行业业务构件、档案行业的业务构件、食品追溯行业的业务构件等等）。基于该平台丰富的配置功能，各种以增、删、改、查为主的应用系统都可以通过后台配置实现，并且通过构件仓库的设计，实现了定义和配置结果的固化和复用，大大提升了软件生产率，使快速满足用户需求成为可能。</p>
                <p>下面对系统配置平台的主要功能作介绍：</p>
                <h1><span class="iconDot"></span><a>1、	强大的自定义功能</a></h1>
                <p>系统配置平台提供了强大的自定义功能，具体包括表定义、报表定义、树定义、工作流定义、构件定义、应用定义等，如下图所示：</p>
                <div class="articleImg clearfix">
                    <img src="../images/config3.jpg" class="oneImg">
                </div>
                <div class="articlelist clearfix">
                    <ul>
                        <li><span class="font-wingdings">ü</span>	表定义：为了满足不同业务需求，该平台提供了丰富的表定义功能，支持基础表、逻辑表、逻辑表组、物理表、物理表组等的定义，支持表的新增、删除、字段复制、同步视图、生成逻辑表、批量建表、下载模板导入、导出等功能；</li>
                        <li><span class="font-wingdings">ü</span>	报表定义：集成报表引擎，支持报表分类定义、报表字段配置以及报表样式配置等功能，以满足不同业务、不同层面的统计需求；</li>
                        <li><span class="font-wingdings">ü</span>	树定义：支持树节点的新增、删除、复制、保存功能；</li>
                        <li><span class="font-wingdings">ü</span>	工作流定义：集成工作流引擎，提供流程自定义功能，采用了图形化的流程节点设计界面，每个流程可以扩展多个流程版本，流程运行中的版本只有一个，可兼容历史版本，支持工作流的工作箱设置功能；</li>
                        <li><span class="font-wingdings">ü</span>	构件定义：主要是通过自定义生成构件，不需要开发工程师进行代码开发；自定义构件包括树构件、物理表构件、逻辑表构件、通用表构件和标签页构件五种类型；这些构件类型划分主要还是取决于各业务系统具体的应用场景，随着业务产品线的拓展，构件的框架会越来丰富，框架构件承担的功能将会更精细；</li>
                        <li><span class="font-wingdings">ü</span>	应用定义：应用定义主要完成构件上的数据列表设置，主要用于对表定义中所设置的物理表、逻辑表进行检索定义、列表字段定义、列表排序定义、界面定义和报表定义（进行报表配置前，需要先在报表定义模块中制作相应的报表）。</li>
                    </ul>
                </div>
                <h1><span class="iconDot"></span><a>2、灵活的系统组装功能</a></h1>
                <p>系统配置平台不但可以实现各类功能的自定义配置，同时也提供了强大的构件库。构件主要来源于两方面，一是通过自定义配置而成，二是通过构件导入而来。基于平台的构件库，通过构件组装定义、树构件组装、物理表构件组装、逻辑表构件组装、通用表构件组装、标签页构件组装，完成构件组装，同时配合菜单定义、应用定义、系统发布等，即可形成一个功能模块或者系统。比如档案管理系统中的借阅管理主界面的构件组装流程如下：</p>
                <div class="articleImg clearfix">
                    <img src="../images/config4.png" class="oneImg">
                </div>
                <p>基于系统配置平台组装而成的借阅管理功能的主页面示意如下：</p>
                <div class="articleImg clearfix">
                    <img src="../images/config5.jpg" class="oneImg">
                </div>
                <p>总的来说，系统配置平台具有如下一些突出特性；</p>
                <div class="articlelist clearfix">
                    <ul>
                        <li>1.	提供了强大的自定义功能，具体包括表定义、报表定义、树定义、工作流定义、构件定义、应用定义等，具体良好的扩展性；</li>
                        <li>2.	提供了后台各类参数的设置功能，尽量做到用户需求的变化不是通过开发，而是通过配置实现；对于配置结果都可以存为模板，方便用户后续操作；</li>
                        <li>3.	作为构件容器和构件仓库的设计思路大大提升了该平台的包容性和整合能力，使其能够成为其他平台的基础，实现工厂化的软件开发；</li>
                        <li>4.	集成工作流引擎和报表引擎，可以方便的调用工作流平台和报表平台满足用户相应需求；并可以方便的实现和系统管理平台的集成，使用同一套单位、组织、用户和权限管理，避免重复定义；</li>
                        <li>5.	基于B/S架构，采用RIA富客户端技术开发，提供了一套完整的Ajax驱动的UI 组件。接口丰富，使用简单，易于创建风格统一、功能全面的富客户端应用，并可兼容多种浏览器，具有良好的数据加载和展现性能。</li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
</div>
</template>

<script>
    export default {

    };
</script>