<template>
    <div v-cloak>
        <mt-header title="信息发布平台" fixed v-if="$root.transitionComplete"></mt-header>
        <div class="section">
            <div class="page-video">
                <iframe width="320" height="240" src='http://player.youku.com/embed/XMjY1MTEzNTU4NA==' frameborder=0 ></iframe>
                <!--
                <video width="320" height="240" controls poster="images/infoplat_screen.jpg"  preload="none" >
                    <source src="http://180.168.156.212:2210/proxy/video/xinxifabupingtai_xuanchuan.mp4" type="video/mp4">
                    您的浏览器不支持 video 标签。
                </video>
                -->
            </div>

            <div class="sectionMargin">
                <div class="mtArticle">
                    <h1 class="mtArticleH1">
                        <span>信息发布平台（CES Infoplat）</span>
                    </h1>
                    <p>信息发布平台就是负责从信息采集录入、信息处理、信息浏览一直到信息撤销等维护过程的信息处理管理及应用平台，为门户系统的建立提供后台支撑。经过十多年的技术探索和积累，我司的信息发布平台也在不断的更新升级和完善，目前已经推出了全新的信息发布平台5.0版本（Ces-Infoplat5.0）。</p>
                    <p>信息发布平台5.0是在原有4.0产品的基础上，采用富客户端开发技术、解决原有产品存在的易用性、兼容性、扩展性问题和性能瓶颈，支持网站群构建、集群部署等高端特性，是一款面向政府、企业客户的综合性门户内容管理软件产品。</p>
                    <p>信息发布平台5.0的系统架构图如下所示：</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat1.jpg" class="oneImg">
                    </div>
                    <p>信息发布平台需要以网络、主机、存储和系统软件等基础设施作为基础支撑，进行安装部署，并基于信息发布平台实现各类门户网站站点频道的管理、网页信息的发布等。同时，信息发布平台也可与我司的系统管理平台、工作流平台进行无缝集成，实现对网站的用户权限管理以及信息采编发流程等的自定义配置。</p>
                    <p>从上图也可以看出，在功能上信息发布平台5.0提供建站管理、内容管理、功能组件、统计分析和系统管理功能。平台的主要功能介绍如下：</p>
                    <h1><a>1、建站管理</a></h1>
                    <p>通过站点建立、站点配置、频道建立、网站发布等业务步骤实现网站或者网站群的建立。</p>
                    <h1><a>1）建立站点</a></h1>
                    <p>站点是网站系统中内容组织的顶层逻辑单元，代表一个独立的URL 入口，一般拥有顶级域名或二级域名。每个站点拥有自己独立的文件夹，包含有自己的一整套模板文件和资源文件，拥有自己独立的内容结构和各种配置项。</p>
                    <p>建立站点将为客户建立一套符合本单位信息发布结构的站点或者站群。平台支持单个站点的建立，也支持网站群的建立。针对网站群，各子站点可独立设置站点结构，也可独立管理模板、数据及发布文件。</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat2.jpg" class="oneImg">
                    </div>
                    <h1><a>2）站点配置</a></h1>
                    <p>站点配置通过模板定义、流程定义、敏感词库配置、组件配置来实现。</p>
                    <p>网站模板由html语言和标签语言组成，网站模板主要控制网站的显示风格和版面设计。信息发布平台提供了强大的模板管理功能，支持模板的分组管理，模板的上传、修改、删除、查看、预览，以及模板的解析和静态页面生成等功能。通过模板管理功能提供良好的模板自定义以及灵活的模板导入导出功能。</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat3.png" class="oneImg">
                    </div>
                    <p>另外，在站点配置过程中，也支持敏感词配置以及组件配置。平台提供了敏感词管理功能，敏感词管理包含了敏感词管理和敏感词过滤两部分，敏感词管理提供对敏感词的添加、修改、删除、导入和导出；敏感词过滤则是在信息发布、用户评论的时候进行敏感词检查，信息发布时文档中包含敏感词时提示用户内容包含敏感词，用户评论出现敏感词时过滤替换敏感词。平台中也提供了友情链接、评论管理、留言管理、调查投票、广告管理等组件功能，在站点配置过程中也根据各站点的实际需求配置相应的功能组件。下图所示为投票组件配置页面：</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat4.png" class="oneImg">
                    </div>
                    <h1><a>3）建立频道</a></h1>
                    <p>每个站点可以划分成多个频道。频道是在网站策划的过程中，按照浏览者的习惯和内容本身的属性进行分类的结果。频道下可以进行细分并添加多个栏目，最终构成多级目录结构。站点频道采用多级频道结构管理，站点的频道和内容管理采取分级管理模式。下图所示为频道建立页面：</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat5.jpg" class="oneImg">
                    </div>
                    <h1><a>4）站点发布</a></h1>
                    <p>站点、频道建立、配置完后，即可进行站点的发布。站点发布支持对站点首页、各频道页面的发布。在站点发布过程中，将所有的页面完全生成静态页面，以全面提高页面访问速度，并增强发布异常的容错和提示能力。另外，站点发布功能还支持跨终端的发布，发布的站点既可以在PC终端上正常访问，也可以在平板电脑和移动终端中正常显示，如下图所示：</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat6.jpg" class="twoImg">
                        <img src="../images/infoplat7.jpg" class="twoImg">
                    </div>
                    <h1><a>2、内容管理</a></h1>
                    <p>站点频道建立完成后，各频道中的内容信息需要通过内容管理进行采集和发布。内容管理提供对文档内容信息的采集、审核和发布功能。</p>
                    <h1><a>1）文档采集</a></h1>
                    <p>信息发布平台5.0提供了文档编辑器和版式文件上传两种文档采集方式。在文档采集过程中，平台能智能提取文档关键字、摘要、缩略图等。</p>
                    <p>文档编辑器，平台提供了全屏编辑器，能够以类似Word 的操作方式对文章在线进行便捷地编辑，提供与Word 相似的剪切、复制、粘贴、查找替换、删除、去除文字格式、撤消、恢复、段落格式、字体、字号、字体颜色、插入超链接、加粗、下划线、居中显示等功能。支持图文混排、图表混排，可以在文章中插入图片、图表，并支持插入Flash动画、超级链接、特殊字符、音频视频等。从Web 网页上复制内容到编辑器时，支持远程图片自动下载到本地服务器。文章编辑器支持清除Word格式、自动排版、插入附件、热词链接、内容分页等功能。界面示意如下：</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat8.jpg" class="oneImg">
                    </div>
                    <p>对于版式文件，提供版式文件的上传和转换功能，上传的版式文件保持原样式不变，用户无需对版式文件进行编辑即可进行预览和发布。</p>
                    <p>另外，系统也支持对图片和音视频文件的采集，针对图片文件，平台支持批量图片上传功能，并且在图片上传过程中自动生成缩略图；针对音视频文件，平台支持大文件上传，文件描述和在线播放功能。</p>
                    <h1><a>2）文档审核</a></h1>
                    <p>文档采集完成后，需要提交相关人员进行审核。平台内置了工作流引擎，支持文档审核流程的自定义配置。同时系统提供了待办提醒功能，提醒相关人员快速审核。审核通过后即可进行文档发布。</p>
                    <h1><a>3）文档发布</a></h1>
                    <p>文档发布指把审核通过的文档发布到站点频道上（一个或多个），并使之能够被网络用户访问的过程。信息发布平台支持中文（简、繁）、英文等语言的发布。文档发布支持一档多发、发布属性设置功能。</p>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat9.jpg" class="oneImg">
                    </div>
                    <div class="articlelist clearfix">
                        <ul>
                            <li><span class="font-wingdings">l</span>	一档多发：一篇文档可以同时（或分步）发布到不同的站点或频道上，如一条新闻可以同时发布到单位的局域网、政务网和互联网。一档多发的好处就是信息集中管理、统一管理。</li>
                            <li><span class="font-wingdings">l</span>	发布属性设置：支持实现延时发布、定时发布、显示有效期控制等功能。</li>
                        </ul>
                    </div>
                    <h1><a>3、统计分析</a></h1>
                    <p>针对网站运营数据进行统计、分析，通过统计分析结果，站点管理人员能够更好地掌握网站运行情况。统计功能主要包括网站访问统计、发布统计，统计结果支持列表生成，也支持图形化统计。所有的统计数据都支持导出Excel 表格。平台主要提供以下信息的统计功能：</p>
                    <div class="articlelist clearfix">
                        <ul>
                            <li><span class="font-wingdings">l</span>	全站（所有站点）历史PV访问总量；</li>
                            <li><span class="font-wingdings">l</span>	单个站点历史PV访问总量；</li>
                            <li><span class="font-wingdings">l</span>	栏目历史PV访问总量；</li>
                            <li><span class="font-wingdings">l</span>	当月全站（所有站点）历史PV访问总量；</li>
                            <li><span class="font-wingdings">l</span>	当月单个站点历史PV访问总量；</li>
                            <li><span class="font-wingdings">l</span>	当月栏目历史PV访问总量；</li>
                            <li><span class="font-wingdings">l</span>	内容发布统计，按站点、频道统计一段时间内发布的内容数量。</li>
                        </ul>
                    </div>
                    <div class="articleImg clearfix">
                        <img src="../images/infoplat10.png" class="oneImg">
                    </div>
                    <p>总的来说，信息发布平台5.0具有如下优势：</p>
                    <div class="articlelist clearfix">
                        <ul>
                            <li>1、	兼容性强：信息发布平台5.0能兼容各种主流的操作系统、数据库、中间件以及浏览器，满足各类型网站系统建设的需求，支持Windows、Linux等操作系统，支持Oracle、SQL Server、My SQL、达梦等数据库，支持WebSphere、WebLogic、Tomcat、TongWeb等中间件，支持IE、Firefox、Chrome等浏览器；</li>
                            <li>2、	灵活易用：信息发布平台5.0通过架构的升级，使代码更为简洁、高效，访问速度显著提高，有效的提升了平台的性能；通过对我司基础组件平台4.0的集成，提供标准化的操作界面，界面美观，用户也更容易上手；通过提供各种自定义配置功能，如模板自定义、流程定义等，使得平台更加的灵活易用；</li>
                            <li>3、	稳定安全：信息发布平台5.0通过严格的站点频道权限设置，合理的网站架构及资源文件结构，智能容错、纠错、异常提醒机制，各种安全防护措施等加强站点运行的安全性和稳定性，保证用户任何时候都可以正常访问；</li>
                            <li>4、	灵活完整的采编发流程：信息发布平台5.0支持采编发流程的自定义，可以完全按照用户单位的实际情况设置采编发流程；同时文档的采集支持文本文件、图片、音视频等各种类型文件，并支持图文混排；文档的审核支持多级审批；文档的发布支持一档多发、定时发布等；</li>
                            <li>5、	跨终端发布支持：适应互联网和移动互联网的发展趋势，融合PC网站、手机网站、微信网站打造三站一体的现代网站架构。移动端兼容各尺寸设备，改善网页版在手机上缩放后，字体小、模糊不清、网页加载慢、流量大、操作性差等问题。</li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    export default {

    };
</script>
